#include <stdio.h>

double B(){
    int sum = 0;
    char B [18] = {1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,18,19};
    for (int i = 0; i < 18; ++i){
        sum += B[i];
    }
    return sum/18;

}

/* //Определить, сколько в матрице А (8х6) строк, среднее арифметического значение элементов которых больше среднего 
арифметического значения элементов массива В (18).*/
int main() 
{
   char A [9][7] = {
    {1, 2, 3, 4, 5, 6},
    {11, 22, 33, 44, 55, 66},
    {12, 23, 34, 45, 56, 67},
    {13, 24, 35, 46, 57, 68},
    {10, 20, 30, 40, 50, 60},
    {16, 52, 34, 43, 52, 61},
    {17, 82, 93, 41, 25, 36},
    {10, 25, 32, 58, 58, 64},};
       

    

    double sum = 0, cou = 0;

    for (int i = 0; i < 8; ++i)
    {
        for (int j = 0; j < 6; ++j)

            sum += A[i][j];
            sum = sum / 6;
            if (sum > B()){cou+=1;}
            printf("%lf", cou);
            sum = 0;
            cou = 0;
            
        printf("\n");
    }
}